# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
fusion_depth: 2  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 设计一个自适应融合模块
backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2  [ch_out, kernel, stride, padding]=[64, 6, 2, 2] 故输出为[64*320*320]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4  输出为128*160*160
  ]


backbone2:
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 2-P1/2  [ch_out, kernel, stride, padding]=[64, 6, 2, 2] 故输出为[64*320*320]
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  输出为128*160*160
   [[-1,1], 1, AFF, [4]],
   [-1, 3, C3, [128]],                    #5 输出为128*160*160
   [-1, 1, Conv, [256, 3, 2]],  # 6-P3/8  输出为256*80*80
   [-1, 6, C3, [256]],                    # 输出为256*80*80
   [-1, 1, Conv, [512, 3, 2]],  # 8-P4/16   输出为512*40*40
   [-1, 9, C3, [512]],                     # 输出为512*40*40
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32   输出为1024*20*20
   [-1, 3, C3, [1024]],                    # 输出为1024*20*20
   [-1, 1, SPPF, [1024, 5]],  # 12        # 输出为1024*20*20
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[20, 23, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]