# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
fusion_depth: 3  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 设计一个自适应融合模块
backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  # 0-P1/2
   #640*640*3
   [-1, 1, Conv, [128, 3, 2]],

   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8  #2  128*80*80
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  # 0-P1/2
   #640*640*3
   [-1, 1, Conv, [128, 3, 2]], #
   [[-1,1], 1, AFF_HW, [4]],
   [-1, 3, C2f, [128, True]],  #128*160*160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
   [-1, 6, C2f, [512, True]],
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
   [-1, 3, C2f, [1024, True]],
   [-1, 1, SPPF, [1024, 5]],  # 13  20*20
  ]


# YOLOv5 v6.0 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 40*40
   [[-1, 10], 1, Concat,[1]],  # cat backbone P4
   [-1, 3, C2f_RepGhost, [512]],  # 18

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 80*80
   [[-1, 8,2], 1, Concat,[1]],  # cat backbone P3
   [-1, 3, C2f_RepGhost, [256]], # 18 (P3/8-small)

   [-1, 1, RepGhostModule, [256, 3,3, 2]],         # 40*40
   [[-1, 16], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f_RepGhost, [512]],  # 21 (P4/16-medium)

   [-1, 1, RepGhostModule, [512, 3,3, 2]],         # 20*20
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2f_RepGhost, [1024]] ,  # 24 (P5/32-large)

   [[19, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
