# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
fusion_depth: 2  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 设计一个自适应融合模块
backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  # 0-P1/2
   #640*640*3
   [-1, 1, Conv, [128, 3, 2]],
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  # 0-P1/2
   #640*640*3
   [-1, 1, Conv, [128, 3, 2]], #
   [[-1, 1], 1,Dual_BA2M_AFF , [8,0,0]],  #
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]], # 8-P4/16
   [-1, 6, C2f, [512, True]],   #9
   [-1, 1, Conv, [1024, 3, 2]], # 10-P5/32
   [-1, 3, C2f, [1024, True]],
   [-1, 1, SPPF, [1024, 5]],  # 12
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat,[1]],  # cat backbone P4
   [-1, 3, C2f, [512]],  # 15

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat,[1]],  # cat backbone P3
   [-1, 3, C2f, [256]], # 18 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f, [512]],  # 21 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2f, [1024]] ,  # 24 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

